# Индивидуальная практическая работа 1 по дисциплине ЛОИС
# Выполнена студентом группы 221702 БГУИР Потоцкий Даниил Александрович
# Файл старта и основного алгоритма прямого нечёткого вывода программы
# Последние изменения: 30.10.2024, версия: 1
#
# Использованные источники:
# Логические основы интеллектуальных систем. Практикум: учебно-методическое пособие / В.В.Голенков, В.П.Ивашенко, Д.Г.Колб, К.А.Уваров. – Минск: БГУИР, 2011.
from fuzzy_logic import algorithm

if __name__ == "__main__":
    algorithm("input1.txt")
