# Индивидуальная практическая работа 1 по дисциплине ЛОИС
# Вариант 4
# Выполнена студентом группы 221702 БГУИР Потоцкий Даниил Александрович
# Файл старта и основного алгоритма обратного нечёткого вывода программы
# Последние изменения: 02.12.2024, версия: 1
#
# Использованные источники:
# Логические основы интеллектуальных систем. Практикум: учебно-методическое пособие / В.В.Голенков, В.П.Ивашенко, Д.Г.Колб, К.А.Уваров. – Минск: БГУИР, 2011.

from reverse_inference import find_reverse_inference

if __name__ == "__main__":
    find_reverse_inference("input1.txt")